# This Python file uses the following encoding: utf-8
import unittest
import pythainlp.util
from pythainlp.tokenize import word_tokenize
from pythainlp.util import find_keyword
from pythainlp.summarize import summarize

class TestThai(unittest.TestCase):
    def setUp(self):
        self.data = ['การทำเกษตรกรรมในปัจจุบันต้องยอมรับว่า “มีการนำสารเคมี และยากำจัดศัตรูพืช” เข้ามาใช้ประโยชน์อย่างแพร่หลาย “เพื่อช่วยเพิ่มปริมาณผลผลิตและทางกายภาพที่สวยงาม” ให้สามารถจำหน่ายแข่งขันในท้องตลาดได้ ทำให้มีการนำเข้าสารเคมีกลุ่มนี้ปริมาณสูงขึ้นอย่างต่อเนื่องทุกปี', 'กลายเป็นว่า “สารเคมีเหล่านี้ตกค้างในสิ่งแวดล้อมและผลผลิต” ส่งผลกระทบเป็นอันตรายต่อสุขภาพคนไทยจากการรับประทานอาหารปนเปื้อนเข้าสู่ร่างกาย ทำให้ในช่วงที่ผ่านมามีการเรียกร้องให้ยกเลิกการใช้สารพาราควอต ไกลโฟเซต และคลอร์ไพริฟอส เพื่อให้เกิดความปลอดภัยในการบริโภคผลิตผลทางการเกษตรนั้น', 'แล้วไม่นานมานี้ Thai Climate Justice for All ร่วมกับสมัชชาองค์กรเอกชนด้านการคุ้มครองสิ่งแวดล้อมและอนุรักษ์ทรัพยากร และศูนย์มานุษยวิทยาสิรินธร (องค์การมหาชน) จัดเวที Ted Talk Climate Change สิ่งแวดล้อมประจำปี 2565 จากมุมมองนักเคลื่อนไหวภาคประชาสังคม และนักวิชาการทำงานกับประชาชนแต่ละด้าน']
        self.thai = Thai(self.data)
        
    def test_get_sentence(self):
        self.assertEqual(self.thai.sentence, 'การทำเกษตรกรรมในปัจจุบันต้องยอมรับว่า “มีการนำสารเคมี และยากำจัดศัตรูพืช” เข้ามาใช้ประโยชน์อย่างแพร่หลาย “เพื่อช่วยเพิ่มปริมาณผลผลิตและทางกายภาพที่สวยงาม” ให้สามารถจำหน่ายแข่งขันในท้องตลาดได้ ทำให้มีการนำเข้าสารเคมีกลุ่มนี้ปริมาณสูงขึ้นอย่างต่อเนื่องทุกปี กลายเป็นว่า “สารเคมีเหล่านี้ตกค้างในสิ่งแวดล้อมและผลผลิต” ส่งผลกระทบเป็นอันตรายต่อสุขภาพคนไทยจากการรับประทานอาหารปนเปื้อนเข้าสู่ร่างกาย ทำให้ในช่วงที่ผ่านมามีการเรียกร้องให้ยกเลิกการใช้สารพาราควอต ไกลโฟเซต และคลอร์ไพริฟอส เพื่อให้เกิดความปลอดภัยในการบริโภคผลิตผลทางการเกษตรนั้น แล้วไม่นานมานี้ Thai Climate Justice for All ร่วมกับสมัชชาองค์กรเอกชนด้านการคุ้มครองสิ่งแวดล้อมและอนุรักษ์ทรัพยากร และศูนย์มานุษยวิทยาสิรินธร (องค์การมหาชน) จัดเวที Ted Talk Climate Change สิ่งแวดล้อมประจำปี 2565 จากมุมมองนักเคลื่อนไหวภาคประชาสังคม และนักวิชาการทำงานกับประชาชนแต่ละด้าน')
        
    def test_get_keyword(self):
       self.assertEqual(self.thai.keyword, {})
        
    def test_get_summarize(self):
        self.assertEqual(self.thai.summarize,['ส่งผลกระทบเป็นอันตรายต่อสุขภาพคนไทยจากการรับประทานอาหารปนเปื้อนเข้าสู่ร่างกาย',
 'ทำให้ในช่วงที่ผ่านมามีการเรียกร้องให้ยกเลิกการใช้สารพาราควอต',
 'ร่วมกับสมัชชาองค์กรเอกชนด้านการคุ้มครองสิ่งแวดล้อมและอนุรักษ์ทรัพยากร',
 '“เพื่อช่วยเพิ่มปริมาณผลผลิตและทางกายภาพที่สวยงาม”',
 'และคลอร์ไพริฟอส',
 'ทำให้มีการนำเข้าสารเคมีกลุ่มนี้ปริมาณสูงขึ้นอย่างต่อเนื่องทุกปี',
 'เพื่อให้เกิดความปลอดภัยในการบริโภคผลิตผลทางการเกษตรนั้น',
 'จากมุมมองนักเคลื่อนไหวภาคประชาสังคม',
 'และยากำจัดศัตรูพืช”',
 'เข้ามาใช้ประโยชน์อย่างแพร่หลาย'])

class TestThai2(unittest.TestCase):
    def setUp(self):
        self.data = ['ความคืบหน้าจากสํานักงานคดีอาญาตลิ่งชัน เมื่อเวลา 11.00 น. วันที่ 10 ม.ค. พ.ต.ท.วันชัย พันธพัฒน์ สว. (สอบสวน) สน.บางยี่ขัน นัดหมายให้ น.ส.ธ. นาย ก. ผู้เป็นสามี นาง ข. มารดาของ น.ส.ธ. และนาย พ. บิดาของ น.ส.ธ. เพื่อนําตัวผู้ถูกกล่าวหาและสํานวนการสอบสวนส่งพนักงานอัยการอาญาตลิ่งชัน 2 หลังมีคําสั่งฟ้องกรณีอดีตรองนายกรัฐมนตรี ย. แจ้งความร้องทุกข์ข้อหาร่วมกันฉ้อโกง เรียกสินสอดและทรัพย์ที่ไปสู่ขอ น.ส.ธ.กับบิดาและมารดามาเป็นภรรยาคืน แต่ปรากฏว่า นาย พ.ไม่ให้ความร่วมมือการสอบสวนก่อนหน้าและไม่เดินทางมาพบพนักงานสอบสวนตามหมายเรียก จึงขออนุมัติศาลอาญาตลิ่งชันออกหมายจับ และศาลอนุมัติหมายจับแล้ว วันนี้จึงส่งสํานวนพร้อมตัวผู้ต้องหา 1-3 ให้พนักงานอัยการอาญาตลิ่งชัน', 'หลังจากนั้น พ.ต.ท.วันชัย พันธพัฒน์ สว. (สอบสวน) สน.บางยี่ขัน ทําหนังสือแจ้งความคืบหน้าการสอบสวน (สรุปสํานวนส่งอัยการ) ที่ ตช 0015. (บก.น.7) 4 (ว.พ.) ลงวันที่ 10 ม.ค.“เรียน นาย ย.ผู้เสียหาย ตามที่ท่านแจ้งความร้องทุกข์ดําเนินคดีอาญาต่อพนักงานสอบสวน ดําเนินคดีกับ น.ส.ธ.ผู้ต้องหาที่ 1 นาย ก. ผู้ต้องหาที่ 2 นาง ข. ผู้ต้องหาที่ 3 และนาย พ. ผู้ต้องหาที่ 4 ข้อหาร่วมกันฉ้อโกง และพนักงานสอบสวนได้รับคําร้องทุกข์ไว้แล้วตามคดีอาญาที่ 546/2565 และพนักงานสอบสวนดําเนินการสอบสวนแล้วนั้น', 'ขอแจ้งความคืบหน้าผลการดําเนินการของพนักงานสอบสวนให้ทราบดังนี้ 1.ขณะนี้พนักงานสอบสวนได้สรุปสํานวนสั่งฟ้อง น.ส.ธ. ผู้ต้องหาที่ 1 นาย ก. ผู้ต้องหาที่ 2 นาง ข. ผู้ต้องหาที่ 3 และนาย พ. ผู้ต้องหาที่ 4 ข้อหาร่วมกันฉ้อโกงและในส่วนผู้ต้องหาที่ 4 พนักงานสอบสวนได้ขออนุมัติศาลอาญาตลิ่งชันออกหมายจับและศาลอนุมัติหมายจับแล้ว ตามหมายจับที่ จ.4/2566 ลงวันที่ 5 ม.ค.2566 และส่งสํานวนพร้อมตัวผู้ต้องหา 1-3 ให้พนักงานอัยการอาญาตลิ่งชัน 2 แล้ว ในวันที่ 10 ม.ค.2566 และขณะนี้อยู่ระหว่างพิจารณาคดีในชั้นอัยการในชั้นศาล', '2.สิ่งที่ต้องดําเนินการต่อไป 2.1 เจ้าหน้าที่ตํารวจและหน่วยงานที่เกี่ยวข้องเร่งติดตามจับกุมตัวนาย พ. ผู้ต้องหาที่ 4 ตามหมายจับเพื่อดําเนินการตามกฎหมายภายในอายุความ 2.2 ติดตามการพิจารณาคดีในชั้นอัยการในชั้นศาลต่อไป 3.ข้อเสนอแนะ (ถ้ามี) ขอให้ติดตามสอบถามผลพิจารณาคดีในชั้นอัยการในชั้นศาลกับพนักงานสอบสวนต่อไป หมายเหตุ หากท่านประสงค์จะแจ้งข้อมูลข่าวสารที่เป็นประโยชน์ต่อการสอบสวนเพิ่มเติม หรือมีข้อสงสัยเกี่ยวกับผลการดําเนินการตามที่แจ้งข้างต้น สามารถติดต่อได้ที่ พ.ต.ท.วันชัย พันธพัฒน์ สว. (สอบสวน) สน.บางยี่ขัน']
        self.thai = Thai(self.data)
        
    def test_get_sentence(self):
        self.assertEqual(self.thai.sentence, 'ความคืบหน้าจากสํานักงานคดีอาญาตลิ่งชัน เมื่อเวลา 11.00 น. วันที่ 10 ม.ค. พ.ต.ท.วันชัย พันธพัฒน์ สว. (สอบสวน) สน.บางยี่ขัน นัดหมายให้ น.ส.ธ. นาย ก. ผู้เป็นสามี นาง ข. มารดาของ น.ส.ธ. และนาย พ. บิดาของ น.ส.ธ. เพื่อนําตัวผู้ถูกกล่าวหาและสํานวนการสอบสวนส่งพนักงานอัยการอาญาตลิ่งชัน 2 หลังมีคําสั่งฟ้องกรณีอดีตรองนายกรัฐมนตรี ย. แจ้งความร้องทุกข์ข้อหาร่วมกันฉ้อโกง เรียกสินสอดและทรัพย์ที่ไปสู่ขอ น.ส.ธ.กับบิดาและมารดามาเป็นภรรยาคืน แต่ปรากฏว่า นาย พ.ไม่ให้ความร่วมมือการสอบสวนก่อนหน้าและไม่เดินทางมาพบพนักงานสอบสวนตามหมายเรียก จึงขออนุมัติศาลอาญาตลิ่งชันออกหมายจับ และศาลอนุมัติหมายจับแล้ว วันนี้จึงส่งสํานวนพร้อมตัวผู้ต้องหา 1-3 ให้พนักงานอัยการอาญาตลิ่งชัน หลังจากนั้น พ.ต.ท.วันชัย พันธพัฒน์ สว. (สอบสวน) สน.บางยี่ขัน ทําหนังสือแจ้งความคืบหน้าการสอบสวน (สรุปสํานวนส่งอัยการ) ที่ ตช 0015. (บก.น.7) 4 (ว.พ.) ลงวันที่ 10 ม.ค.“เรียน นาย ย.ผู้เสียหาย ตามที่ท่านแจ้งความร้องทุกข์ดําเนินคดีอาญาต่อพนักงานสอบสวน ดําเนินคดีกับ น.ส.ธ.ผู้ต้องหาที่ 1 นาย ก. ผู้ต้องหาที่ 2 นาง ข. ผู้ต้องหาที่ 3 และนาย พ. ผู้ต้องหาที่ 4 ข้อหาร่วมกันฉ้อโกง และพนักงานสอบสวนได้รับคําร้องทุกข์ไว้แล้วตามคดีอาญาที่ 546/2565 และพนักงานสอบสวนดําเนินการสอบสวนแล้วนั้น ขอแจ้งความคืบหน้าผลการดําเนินการของพนักงานสอบสวนให้ทราบดังนี้ 1.ขณะนี้พนักงานสอบสวนได้สรุปสํานวนสั่งฟ้อง น.ส.ธ. ผู้ต้องหาที่ 1 นาย ก. ผู้ต้องหาที่ 2 นาง ข. ผู้ต้องหาที่ 3 และนาย พ. ผู้ต้องหาที่ 4 ข้อหาร่วมกันฉ้อโกงและในส่วนผู้ต้องหาที่ 4 พนักงานสอบสวนได้ขออนุมัติศาลอาญาตลิ่งชันออกหมายจับและศาลอนุมัติหมายจับแล้ว ตามหมายจับที่ จ.4/2566 ลงวันที่ 5 ม.ค.2566 และส่งสํานวนพร้อมตัวผู้ต้องหา 1-3 ให้พนักงานอัยการอาญาตลิ่งชัน 2 แล้ว ในวันที่ 10 ม.ค.2566 และขณะนี้อยู่ระหว่างพิจารณาคดีในชั้นอัยการในชั้นศาล 2.สิ่งที่ต้องดําเนินการต่อไป 2.1 เจ้าหน้าที่ตํารวจและหน่วยงานที่เกี่ยวข้องเร่งติดตามจับกุมตัวนาย พ. ผู้ต้องหาที่ 4 ตามหมายจับเพื่อดําเนินการตามกฎหมายภายในอายุความ 2.2 ติดตามการพิจารณาคดีในชั้นอัยการในชั้นศาลต่อไป 3.ข้อเสนอแนะ (ถ้ามี) ขอให้ติดตามสอบถามผลพิจารณาคดีในชั้นอัยการในชั้นศาลกับพนักงานสอบสวนต่อไป หมายเหตุ หากท่านประสงค์จะแจ้งข้อมูลข่าวสารที่เป็นประโยชน์ต่อการสอบสวนเพิ่มเติม หรือมีข้อสงสัยเกี่ยวกับผลการดําเนินการตามที่แจ้งข้างต้น สามารถติดต่อได้ที่ พ.ต.ท.วันชัย พันธพัฒน์ สว. (สอบสวน) สน.บางยี่ขัน')
    def test_get_keyword(self):
       self.assertEqual(self.thai.keyword, {'สว': 3, 'สอบสวน': 8, 'อาญา': 3, 'ศาล': 5})
        
    def test_get_summarize(self):
        self.assertEqual(self.thai.summarize,['ขอให้ติดตามสอบถามผลพิจารณาคดีในชั้นอัยการในชั้นศาลกับพนักงานสอบสวนต่อไป',
 'เพื่อนําตัวผู้ถูกกล่าวหาและสํานวนการสอบสวนส่งพนักงานอัยการอาญาตลิ่งชัน',
 'ติดตามการพิจารณาคดีในชั้นอัยการในชั้นศาลต่อไป',
 'พนักงานสอบสวนได้ขออนุมัติศาลอาญาตลิ่งชันออกหมายจับและศาลอนุมัติหมายจับแล้ว',
 'ตามที่ท่านแจ้งความร้องทุกข์ดําเนินคดีอาญาต่อพนักงานสอบสวน',
 'ขอแจ้งความคืบหน้าผลการดําเนินการของพนักงานสอบสวนให้ทราบดังนี้',
 'และพนักงานสอบสวนดําเนินการสอบสวนแล้วนั้น',
 'และขณะนี้อยู่ระหว่างพิจารณาคดีในชั้นอัยการในชั้นศาล',
 '1.ขณะนี้พนักงานสอบสวนได้สรุปสํานวนสั่งฟ้อง',
 'พ.ไม่ให้ความร่วมมือการสอบสวนก่อนหน้าและไม่เดินทางมาพบพนักงานสอบสวนตามหมายเรียก'])


class TestThai3(unittest.TestCase):
    def setUp(self):
        self.data = ['เบรกชั่วคราวการติดตั้งป้ายใหม่ ของสถานีกลางบางซื่อ วงเงิน 33 ล้านบาท หลังเกิดกระแสดราม่าถล่มหนัก คณะกรรมการสอบข้อเท็จจริงประชุมนัดแรก ขอเวลา 15 วันสอบจาก 9 ประเด็นที่ให้ รฟท.แจงเหตุผล เคลียร์ให้ชัดถึงการเปลี่ยนป้ายเป็นสถานีกลางกรุงเทพอภิวัฒน์ในงบก้อนโต พร้อมตั้ง 2 ประเด็นหลัก รฟท.ทําตาม ระเบียบจัดซื้อจัดจ้างหรือไม่ และสามารถปรับราคาจัดจ้างถูกกว่าที่เป็นอยู่ได้หรือไม่ ด้านผู้ว่าการ รฟท. ไม่มาประชุม แต่ออกหนังสือถึงบริษัทที่รับจ้างติดตั้งป้ายชื่อสถานีกลางบางซื่อเป็นสถานีกลางกรุงเทพอภิวัฒน์ และตราสัญลักษณ์ของการรถไฟฯชะลอการติดตั้งเพื่อรอผลสอบสวน', 'โครงการเปลี่ยนป้ายชื่อ “สถานีกลางบางซื่อ” เป็น “สถานีกลางกรุงเทพอภิวัฒน์” ที่มีการตั้งงบประมาณการจัดทําป้ายใหม่ในราคาสูงลิบลิ่วถึง 33 ล้านบาท จนกลายเป็นกระแสดราม่าอย่างหนักในโลกโซเชียล ประชาชนส่วนใหญ่มีความเห็นตรงกันว่าเม็ดเงินค่าจัดทําป้ายใหม่มากเกินความจริงและมองดูว่ามีความไม่โปร่งใส จนในที่สุดโครงการดังกล่าวถูกเบรกให้ชะลอการติดตั้งไว้ก่อนเพื่อดําเนินการสอบสวนข้อเท็จจริงในเรื่องนี้', 'เมื่อวันที่ 10 ม.ค. นายสรพงศ์ ไพฑูรย์พงษ์ รองปลัดกระทรวงคมนาคม ในฐานะประธานคณะกรรมการตรวจสอบข้อเท็จจริง โครงการปรับปรุงป้ายชื่อ “สถานีกลางบางซื่อ” เป็น “สถานีกลางกรุงเทพอภิวัฒน์” เปิดเผยภายหลังการประชุมครั้งแรกว่า การประชุมครั้งนี้ รฟท.ส่งรายละเอียดและชี้แจงข้อเท็จจริงที่คณะกรรมการตั้งประเด็นไป 9 ประเด็น ประกอบด้วย 1.ความเป็นมาของโครงการ 2.ขอบเขตงาน หรือ TOR 3.รายละเอียดราคากลาง 4.รายงานการ ประชุมคณะกรรมการกําหนดราคากลาง (ทุกครั้ง) 5.การขออนุมัติจัดซื้อจัดจ้าง บันทึกสั่งจ้างและรายละเอียดการสั่งจ้าง 6.สําเนาข้อเสนอราคาของบริษัทผู้รับจ้าง 7.สําเนารายงานการประชุมคณะกรรมการจ้างทุกครั้ง 8.สัญญาจ้าง 9.เปรียบเทียบราคาการติดตั้งป้ายกับราคาตลาดโดยทั่วไป ทั้งนี้ ในการประชุมดังกล่าวผู้ว่าการ รฟท.ไม่ได้มาชี้แจงด้วยตนเอง โดยคณะกรรมการสอบข้อเท็จจริงมีกําหนดต้องรายงานผลการสอบสวนให้กระทรวงคมนาคมทราบภายใน 15 วัน']
        self.thai = Thai(self.data)
        
    def test_get_sentence(self):
        self.assertEqual(self.thai.sentence, 'เบรกชั่วคราวการติดตั้งป้ายใหม่ ของสถานีกลางบางซื่อ วงเงิน 33 ล้านบาท หลังเกิดกระแสดราม่าถล่มหนัก คณะกรรมการสอบข้อเท็จจริงประชุมนัดแรก ขอเวลา 15 วันสอบจาก 9 ประเด็นที่ให้ รฟท.แจงเหตุผล เคลียร์ให้ชัดถึงการเปลี่ยนป้ายเป็นสถานีกลางกรุงเทพอภิวัฒน์ในงบก้อนโต พร้อมตั้ง 2 ประเด็นหลัก รฟท.ทําตาม ระเบียบจัดซื้อจัดจ้างหรือไม่ และสามารถปรับราคาจัดจ้างถูกกว่าที่เป็นอยู่ได้หรือไม่ ด้านผู้ว่าการ รฟท. ไม่มาประชุม แต่ออกหนังสือถึงบริษัทที่รับจ้างติดตั้งป้ายชื่อสถานีกลางบางซื่อเป็นสถานีกลางกรุงเทพอภิวัฒน์ และตราสัญลักษณ์ของการรถไฟฯชะลอการติดตั้งเพื่อรอผลสอบสวน โครงการเปลี่ยนป้ายชื่อ “สถานีกลางบางซื่อ” เป็น “สถานีกลางกรุงเทพอภิวัฒน์” ที่มีการตั้งงบประมาณการจัดทําป้ายใหม่ในราคาสูงลิบลิ่วถึง 33 ล้านบาท จนกลายเป็นกระแสดราม่าอย่างหนักในโลกโซเชียล ประชาชนส่วนใหญ่มีความเห็นตรงกันว่าเม็ดเงินค่าจัดทําป้ายใหม่มากเกินความจริงและมองดูว่ามีความไม่โปร่งใส จนในที่สุดโครงการดังกล่าวถูกเบรกให้ชะลอการติดตั้งไว้ก่อนเพื่อดําเนินการสอบสวนข้อเท็จจริงในเรื่องนี้ เมื่อวันที่ 10 ม.ค. นายสรพงศ์ ไพฑูรย์พงษ์ รองปลัดกระทรวงคมนาคม ในฐานะประธานคณะกรรมการตรวจสอบข้อเท็จจริง โครงการปรับปรุงป้ายชื่อ “สถานีกลางบางซื่อ” เป็น “สถานีกลางกรุงเทพอภิวัฒน์” เปิดเผยภายหลังการประชุมครั้งแรกว่า การประชุมครั้งนี้ รฟท.ส่งรายละเอียดและชี้แจงข้อเท็จจริงที่คณะกรรมการตั้งประเด็นไป 9 ประเด็น ประกอบด้วย 1.ความเป็นมาของโครงการ 2.ขอบเขตงาน หรือ TOR 3.รายละเอียดราคากลาง 4.รายงานการ ประชุมคณะกรรมการกําหนดราคากลาง (ทุกครั้ง) 5.การขออนุมัติจัดซื้อจัดจ้าง บันทึกสั่งจ้างและรายละเอียดการสั่งจ้าง 6.สําเนาข้อเสนอราคาของบริษัทผู้รับจ้าง 7.สําเนารายงานการประชุมคณะกรรมการจ้างทุกครั้ง 8.สัญญาจ้าง 9.เปรียบเทียบราคาการติดตั้งป้ายกับราคาตลาดโดยทั่วไป ทั้งนี้ ในการประชุมดังกล่าวผู้ว่าการ รฟท.ไม่ได้มาชี้แจงด้วยตนเอง โดยคณะกรรมการสอบข้อเท็จจริงมีกําหนดต้องรายงานผลการสอบสวนให้กระทรวงคมนาคมทราบภายใน 15 วัน')
    def test_get_keyword(self):
       self.assertEqual(self.thai.keyword, {'กลาง': 10, 'คณะกรรมการ': 5, 'สอบ': 3, 'สอบสวน': 3, 'โครงการ': 3, 'ราคา': 5})
        
    def test_get_summarize(self):
        self.assertEqual(self.thai.summarize,['แต่ออกหนังสือถึงบริษัทที่รับจ้างติดตั้งป้ายชื่อสถานีกลางบางซื่อเป็นสถานีกลางกรุงเทพอภิวัฒน์',
 'เคลียร์ให้ชัดถึงการเปลี่ยนป้ายเป็นสถานีกลางกรุงเทพอภิวัฒน์ในงบก้อนโต',
 '“สถานีกลางกรุงเทพอภิวัฒน์”',
 '“สถานีกลางกรุงเทพอภิวัฒน์”',
 'จนในที่สุดโครงการดังกล่าวถูกเบรกให้ชะลอการติดตั้งไว้ก่อนเพื่อดําเนินการสอบสวนข้อเท็จจริงในเรื่องนี้',
 'รฟท.ส่งรายละเอียดและชี้แจงข้อเท็จจริงที่คณะกรรมการตั้งประเด็นไป',
 '“สถานีกลางบางซื่อ”',
 '“สถานีกลางบางซื่อ”',
 '9.เปรียบเทียบราคาการติดตั้งป้ายกับราคาตลาดโดยทั่วไป',
 'โดยคณะกรรมการสอบข้อเท็จจริงมีกําหนดต้องรายงานผลการสอบสวนให้กระทรวงคมนาคมทราบภายใน'])


class Thai:
    def __init__(self,data:list):
        self.data_value = data
        self.sentence = self.get_sentence()
        self.keyword = self.get_keyword()
        self.summarize = self.get_summarize()
    def make_sentence(self,list_word):
        self.sentence_value = ''
        for i in list_word:
            for i in list_word:
                if pythainlp.util.countthai(i)<30:
                    list_word.remove(i)
        self.sentence_value = ' '.join(list_word)
        return self.sentence_value
    def get_sentence(self):
        self.sentence_result = self.make_sentence(self.data_value)
        return self.sentence_result
    def get_keyword(self):
        self.keyword_result = {}
        self.keyword_value = word_tokenize(self.sentence, engine="newmm")
        self.keyword_dict = find_keyword(self.keyword_value)
        # Iterate over the keys in the dictionary
        for key in self.keyword_dict:
        # Check if the key is text (i.e., not a space or quotation mark)
            if key.isalpha():
            # If the key is text, add it to the new dictionary
                self.keyword_result[key] = self.keyword_dict[key]
        return self.keyword_result
    def get_summarize(self):
        self.summarize_result =[]
        self.summarize_result = summarize(self.sentence,n=10)
        return self.summarize_result

if __name__ == '__main__':
    unittest.main()